In [1]:
import pandas as pd

### Reading Different types of files **(CSV, EXCEL, JSON)** and creating dataframes from it

In [2]:
# Reading the CSV file
read_csvs = pd.read_csv("../../06 pandas/2 Creating Data frame/new_data.csv")
read_csvs

        EST  Temprature  WindSpeedMPH     Event
0  1/1/2016          44             2      Rain
1  1/2/2016          39             3      Snow
2  1/3/2016          39             4  Fog-Snow
3  1/4/2016          33             4  Fog-Snow
4  1/5/2016          20             5      Snow
5  1/6/2016          25             8      Rain
6  1/7/2016          46             5      Snow

In [3]:
# Reading the EXCEL file
read_excel = pd.read_excel("../../06 pandas/2 Creating Data frame/weather_data.xlsx")
read_excel

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [4]:
# Reading the json file
read_json = pd.read_json("./human_data.json")
read_json

     Name  Gender Nationality  Age
0    John    Male          UK   10
1    Nick    Male      French   25
2     Ali  Female         USA   35
3  Joseph    Male      Brazil   29

### Creating Data frame using python dictionary

In [5]:
human_data = {
    "Name":{"0":"John","1":"Nick","2":"Ali","3":"Joseph"},
    "Gender":{"0":"Male","1":"Male","2":"Female","3":"Male"},
    "Nationality":{"0":"UK","1":"French","2":"USA","3":"Brazil"},
    "Age" :{"0":10,"1":25,"2":35,"3":29}
}

human_data_df = pd.DataFrame(human_data)
human_data_df

     Name  Gender Nationality  Age
0    John    Male          UK   10
1    Nick    Male      French   25
2     Ali  Female         USA   35
3  Joseph    Male      Brazil   29

In [9]:
# some oprtations on DataFrames
human_data = {
    "Name":{"0":"John","1":"Nick","2":"Ali","3":"Joseph"},
    "Gender":{"0":"Male","1":"Male","2":"Female","3":"Male"},
    "Nationality":{"0":"UK","1":"French","2":"USA","3":"Brazil"},
    "Age" :{"0":10,"1":25,"2":35,"3":29}
}

human_data_df = pd.DataFrame(human_data, index=None)
human_data_df

     Name  Gender Nationality  Age
0    John    Male          UK   10
1    Nick    Male      French   25
2     Ali  Female         USA   35
3  Joseph    Male      Brazil   29

In [11]:
# If you want to print cols and rows
rows, colums = human_data_df.shape
print("Rows: ", rows)
print("Cols: ", colums)

Rows:  4
Cols:  4

In [12]:
read_csvs.head()

        EST  Temprature  WindSpeedMPH     Event
0  1/1/2016          44             2      Rain
1  1/2/2016          39             3      Snow
2  1/3/2016          39             4  Fog-Snow
3  1/4/2016          33             4  Fog-Snow
4  1/5/2016          20             5      Snow

In [13]:
read_csvs.head(2)

        EST  Temprature  WindSpeedMPH Event
0  1/1/2016          44             2  Rain
1  1/2/2016          39             3  Snow

In [14]:
read_csvs.tail()\

        EST  Temprature  WindSpeedMPH     Event
2  1/3/2016          39             4  Fog-Snow
3  1/4/2016          33             4  Fog-Snow
4  1/5/2016          20             5      Snow
5  1/6/2016          25             8      Rain
6  1/7/2016          46             5      Snow

In [15]:
read_csvs.tail(2)

        EST  Temprature  WindSpeedMPH Event
5  1/6/2016          25             8  Rain
6  1/7/2016          46             5  Snow

In [16]:
read_csvs.describe

<bound method NDFrame.describe of         EST  Temprature  WindSpeedMPH     Event
0  1/1/2016          44             2      Rain
1  1/2/2016          39             3      Snow
2  1/3/2016          39             4  Fog-Snow
3  1/4/2016          33             4  Fog-Snow
4  1/5/2016          20             5      Snow
5  1/6/2016          25             8      Rain
6  1/7/2016          46             5      Snow>

In [17]:
read_csvs['Temprature']

0    44
1    39
2    39
3    33
4    20
5    25
6    46
Name: Temprature, dtype: int64

In [23]:
read_csvs[['Temprature', 'EST', 'Event']]

   Temprature       EST     Event
0          44  1/1/2016      Rain
1          39  1/2/2016      Snow
2          39  1/3/2016  Fog-Snow
3          33  1/4/2016  Fog-Snow
4          20  1/5/2016      Snow
5          25  1/6/2016      Rain
6          46  1/7/2016      Snow

In [24]:
read_csvs['Temprature'].mean()

35.142857142857146

In [25]:
read_csvs['Temprature'].min()

20

In [26]:
read_csvs['Temprature'].max()

46

In [27]:
read_csvs[0:3]

        EST  Temprature  WindSpeedMPH     Event
0  1/1/2016          44             2      Rain
1  1/2/2016          39             3      Snow
2  1/3/2016          39             4  Fog-Snow

In [28]:
read_csvs.EST

0    1/1/2016
1    1/2/2016
2    1/3/2016
3    1/4/2016
4    1/5/2016
5    1/6/2016
6    1/7/2016
Name: EST, dtype: object

In [29]:
read_csvs.columns

Index(['EST', 'Temprature', 'WindSpeedMPH', 'Event'], dtype='object')

In [34]:
read_csvs.Temprature > 23

0     True
1     True
2     True
3     True
4    False
5     True
6     True
Name: Temprature, dtype: bool

In [38]:
df = pd.read_csv('../../06 pandas/3 Read Write Excel CSV File/stock_data.csv', skiprows=3)
df

   MSFT             -1  85    64     bill gates
0  RIL   not available  50  1023  mukesh ambani
1  TATA            5.6  -1  n.a.     ratan tata

In [42]:
df = pd.read_csv('../../06 pandas/3 Read Write Excel CSV File/stock_data.csv', header=1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [43]:
df = pd.read_csv('../../06 pandas/3 Read Write Excel CSV File/stock_data.csv', header=None)
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [45]:
df = pd.read_csv('../../06 pandas/3 Read Write Excel CSV File/stock_data.csv', header=None, names=['Tickers', 'Eps', 'Revenue', 'Price', 'People'])
df

   Tickers            Eps  Revenue  Price         People
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [47]:
df = pd.read_csv('../../06 pandas/3 Read Write Excel CSV File/stock_data.csv', na_values={
    'esp': ["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82     87.0   845     larry page
1     WMT           4.61    484.0    65            NaN
2    MSFT             -1     85.0    64     bill gates
3    RIL   not available     50.0  1023  mukesh ambani
4    TATA            5.6      NaN  n.a.     ratan tata